# DataFrame (2-Dimensional DataSet)

In [1]:
import numpy as np
import pandas as pd

In [5]:
data={'Name': ['Deepak','Chirag','Ayushi','Ankita','Aman','Ajay'], 'Age':[25, 24, 24, 23, 24, 25], 'Schooking':['KV','Private','SX','Navoday','Private','Public']}
data

{'Name': ['Deepak', 'Chirag', 'Ayushi', 'Ankita', 'Aman', 'Ajay'],
 'Age': [25, 24, 24, 23, 24, 25],
 'Schooking': ['KV', 'Private', 'SX', 'Navoday', 'Private', 'Public']}

In [6]:
dataf = pd.DataFrame(data)
dataf

     Name  Age Schooking
0  Deepak   25        KV
1  Chirag   24   Private
2  Ayushi   24        SX
3  Ankita   23   Navoday
4    Aman   24   Private
5    Ajay   25    Public

In [7]:
datas = pd.Series(data)
datas

Name         [Deepak, Chirag, Ayushi, Ankita, Aman, Ajay]
Age                              [25, 24, 24, 23, 24, 25]
Schooking     [KV, Private, SX, Navoday, Private, Public]
dtype: object

## Problem Statement

### If we have serires in which data is present as key-value pair and values contain a list of elements. Look at above Series

## First Solution

In [13]:
datan = datas['Name']
datan

['Deepak', 'Chirag', 'Ayushi', 'Ankita', 'Aman', 'Ajay']

In [14]:
dataa = datas['Age']
dataa

[25, 24, 24, 23, 24, 25]

In [15]:
datasc = datas['Schooking']
datasc

['KV', 'Private', 'SX', 'Navoday', 'Private', 'Public']

In [18]:
datasd = {'Name': pd.Series(datan), 'Age': pd.Series(dataa), 'Schooking': pd.Series(datasc)}
datasd

{'Name': 0    Deepak
 1    Chirag
 2    Ayushi
 3    Ankita
 4      Aman
 5      Ajay
 dtype: object,
 'Age': 0    25
 1    24
 2    24
 3    23
 4    24
 5    25
 dtype: int64,
 'Schooking': 0         KV
 1    Private
 2         SX
 3    Navoday
 4    Private
 5     Public
 dtype: object}

In [19]:
datasd = pd.DataFrame(datasd)
datasd

     Name  Age Schooking
0  Deepak   25        KV
1  Chirag   24   Private
2  Ayushi   24        SX
3  Ankita   23   Navoday
4    Aman   24   Private
5    Ajay   25    Public

## Second Solution

In [28]:
datass = {'Name':pd.Series(datas['Name']), 'Age':pd.Series(datas['Age']), 'Schooking':pd.Series(datas['Schooking'])}
datass

{'Name': 0    Deepak
 1    Chirag
 2    Ayushi
 3    Ankita
 4      Aman
 5      Ajay
 dtype: object,
 'Age': 0    25
 1    24
 2    24
 3    23
 4    24
 5    25
 dtype: int64,
 'Schooking': 0         KV
 1    Private
 2         SX
 3    Navoday
 4    Private
 5     Public
 dtype: object}

In [29]:
datassd = pd.DataFrame(datass)
datassd

     Name  Age Schooking
0  Deepak   25        KV
1  Chirag   24   Private
2  Ayushi   24        SX
3  Ankita   23   Navoday
4    Aman   24   Private
5    Ajay   25    Public

## Final Solution

In [33]:
df = pd.DataFrame({'Name':pd.Series(datas['Name']), 'Age':pd.Series(datas['Age']), 'Schooking':pd.Series(datas['Schooking'])})

In [36]:
df

     Name  Age Schooking
0  Deepak   25        KV
1  Chirag   24   Private
2  Ayushi   24        SX
3  Ankita   23   Navoday
4    Aman   24   Private
5    Ajay   25    Public

# Adding Columns

In [37]:
df

     Name  Age Schooking
0  Deepak   25        KV
1  Chirag   24   Private
2  Ayushi   24        SX
3  Ankita   23   Navoday
4    Aman   24   Private
5    Ajay   25    Public

In [38]:
df['Location'] = pd.Series(['Bhopal','Saidol','Bhopal','Aasta','Riwa'], index=[0,1,2,4,5])
df

     Name  Age Schooking Location
0  Deepak   25        KV   Bhopal
1  Chirag   24   Private   Saidol
2  Ayushi   24        SX   Bhopal
3  Ankita   23   Navoday      NaN
4    Aman   24   Private    Aasta
5    Ajay   25    Public     Riwa

### Delect Columns

In [39]:
dfc = df
dfc

     Name  Age Schooking Location
0  Deepak   25        KV   Bhopal
1  Chirag   24   Private   Saidol
2  Ayushi   24        SX   Bhopal
3  Ankita   23   Navoday      NaN
4    Aman   24   Private    Aasta
5    Ajay   25    Public     Riwa

In [40]:
Schooling=df['Schooking']
Schooling

0         KV
1    Private
2         SX
3    Navoday
4    Private
5     Public
Name: Schooking, dtype: object

In [41]:
del dfc['Schooking']
dfc

     Name  Age Location
0  Deepak   25   Bhopal
1  Chirag   24   Saidol
2  Ayushi   24   Bhopal
3  Ankita   23      NaN
4    Aman   24    Aasta
5    Ajay   25     Riwa

#### We can also pop() method to delete columns
dfc.pop('Schooking')

In [44]:
dfc['Schooling'] = pd.Series(Schooling)
dfc

     Name  Age Location Schooling
0  Deepak   25   Bhopal        KV
1  Chirag   24   Saidol   Private
2  Ayushi   24   Bhopal        SX
3  Ankita   23      NaN   Navoday
4    Aman   24    Aasta   Private
5    Ajay   25     Riwa    Public